{
  "backend/main.mo": "Empty Motoko actor canister with no methods defined.",
  "feature_evidence.json": "Lists feature evidence items mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend components, pages, and configuration files.",
  "frontend/index.css": "Tailwind base/theme variable definitions and global styles for colors, borders, and dark mode.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with three routes wrapped in SiteLayout.",
  "frontend/src/components/MorshidButton.tsx": "Custom button wrapper enforcing rounded corners and hover shadows.",
  "frontend/src/components/MorshidCard.tsx": "Custom card wrapper providing white background, shadow, rounded corners, and optional top border color.",
  "frontend/src/components/SiteFooter.tsx": "Footer showing branding, contact info, and Caffeine attribution.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with navigation links that highlight active routes in #25D366.",
  "frontend/src/components/WhatsAppFloatingButton.tsx": "Floating WhatsApp button with green background and hover scaling.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing backend actor instances based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login handling, and identity persistence.",
  "frontend/src/index.css": "Tailwind base styles plus MORSHID brand color variables and global button styling.",
  "frontend/src/layouts/SiteLayout.tsx": "Defines the main site layout with a header, footer, routed content outlet, and a floating WhatsApp button.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with WhatsApp, email, and location cards plus a response-time note.",
  "frontend/src/pages/ForFarmersPage.tsx": "Implements the For Farmers page with a hero section, service cards, and FAQ content using custom UI components.",
  "frontend/src/pages/HomePage.tsx": "Builds the Home page hero and feature sections highlighting MORSHID services with styled cards and CTAs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, custom colors, animations, and plugin integrations for the project.",
  "project_state.json": "Describes the project's current state, requirements, scope updates, known issues, and architectural constraints."
}