{
  "kind": "build_request",
  "title": "Site-wide styling polish: buttons, cards, section backgrounds, and nav hover/active",
  "projectName": "MORSHID",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Update the header navigation link styling so the current route link is highlighted in exactly #25D366 and all navigation links show an underline effect on hover, without changing header structure, labels, or link destinations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Navigation:\nMake the current page link highlighted in green #25D366.\nAdd underline effect on hover for navigation links."
        ]
      },
      "acceptanceCriteria": [
        "On each route (/ , /for-farmers , /contact), exactly one corresponding nav link is visually highlighted using #25D366.",
        "Hovering any nav link shows a visible underline effect (in addition to any existing hover color), and the underline effect works on desktop browsers.",
        "No changes are made to navigation labels (Home, For Farmers, Contact) or their target paths."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Ensure site-wide button styling is consistent and includes rounded corners and a shadow-on-hover effect for every button (including links rendered as buttons), without editing any files under frontend/src/components/ui.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make all buttons have the same style: rounded corners, shadow on hover."
        ]
      },
      "acceptanceCriteria": [
        "All buttons across Home, For Farmers, Contact, and the floating WhatsApp button have rounded corners (where applicable) and show a shadow effect on hover.",
        "No files under frontend/src/components/ui are modified.",
        "Button text, destinations (href/to), and existing layout/spacing are preserved."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Standardize card styling across the site so all cards have: white background, light shadow, rounded corners, and a colored top border that matches each card’s theme (while keeping existing non-green theme colors like blue/orange/brown where they already exist).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Cards styling:\nAll cards should have:\n- White background\n- Light shadow\n- Rounded corners\n- Colored top border matching their theme"
        ]
      },
      "acceptanceCriteria": [
        "All card-like UI elements on Home, For Farmers, and Contact render with a white background, light shadow, and rounded corners.",
        "All cards display a colored top border; cards with an existing theme color retain that theme color for the top border (e.g., blue/orange/brown where already used).",
        "No user-facing text is changed."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Adjust section background styling across all pages so major sections alternate between white, light gray (#F5F5F5), and light green (#E8F5E9) for visual variety, without changing any copy, images, links, or section order.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Section backgrounds:\nAlternate between white, light gray #F5F5F5, and light green #E8F5E9 for visual variety.\n\nDO NOT change anything else."
        ]
      },
      "acceptanceCriteria": [
        "Across Home, For Farmers, and Contact pages, adjacent major sections do not all share the same background; backgrounds alternate using only white, #F5F5F5, and #E8F5E9.",
        "The existing section order, section content, and all links remain unchanged.",
        "The specified hex values (#F5F5F5 and #E8F5E9) are used exactly where those backgrounds are applied."
      ]
    }
  ],
  "constraints": [
    "Do not change anything other than the styling changes explicitly requested (no content/copy changes, no new sections, no link destination changes).",
    "Do not edit any files under frontend/src/components/ui (immutable).",
    "Keep all existing routes and navigation destinations exactly the same.",
    "Any green used for UI styling must remain exactly #25D366 (WhatsApp green)."
  ],
  "nonGoals": [
    "Adding new pages, features, or backend functionality.",
    "Changing brand assets, hero images, or YouTube video IDs/URLs.",
    "Changing the Contact page’s non-green theme colors (e.g., its existing blue email styling) beyond applying the requested shared card/button styling where applicable."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}